# Pandas 2

**[1] Basic operations**<br>
- Copy a DataFrame<br>
- Add/drop column<br>
- Sort<br>

**[2] Data consolidation**<br>
- Concatenate<br>
- Merge<br>

In [1]:
import pandas as pd

## [1] Basic operations

In [2]:
data = {"state": ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000,2001,2002,2001,2002,2003],
        "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
df_raw = pd.DataFrame(data)
df_raw

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### [1.1] Copy a DataFrame

In [3]:
df = df_raw.copy()

### [1.2] Add/drop column

- **Add a new column**

In [4]:
df["eastern"] = [True, True, True, False, False, False]
df

    state  year  pop  eastern
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

- **Add a new column** (An example without using <code>copy()</code>)

In [5]:
df1 = pd.DataFrame(data)  

# (1) assign df1 to another variable named df2 
df2 = df1 

# (2) if you change the content of df2
df2["newcolumn"] = [1,2,3,4,5,5]

# (3) the content of df1 will also change accordingly
df1

    state  year  pop  newcolumn
0    Ohio  2000  1.5          1
1    Ohio  2001  1.7          2
2    Ohio  2002  3.6          3
3  Nevada  2001  2.4          4
4  Nevada  2002  2.9          5
5  Nevada  2003  3.2          5

- **Drop a column**

In [6]:
df.drop(["eastern"], axis = 1)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
#The original object “df” remains unchanged
df

    state  year  pop  eastern
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

- **Drop a column: inplace = True**

In [8]:
df.drop(["eastern"], axis = 1, inplace = True)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## Exercise.A

**(A.1) Given a dataframe. Create a copy named <code>company_df</code> and use it to do A.2~A.4.**

In [3]:
company_raw_df = pd.DataFrame({"company_name":['JPMorgan Chase','Apple','Bank of America','Amazon','Microsoft'],
                            "profit":[40.4, 63.9, 17.9, 21.3, 51.3],
                            "assets":[3689.3, 354.1, 2832.2, 321.2, 304.1]})

In [4]:
company_df = company_raw_df.copy()

**(A.2) Add a new column named <code>market_value</code> with a list of values <code>464.8, 2252.3, 336.3, 1711.8, 1966.6</code>.**

In [5]:
company_df["market_value"] = [464.8, 2252.3, 336.3, 1711.8, 1966.6]
company_df

      company_name  profit  assets  market_value
0   JPMorgan Chase    40.4  3689.3         464.8
1            Apple    63.9   354.1        2252.3
2  Bank of America    17.9  2832.2         336.3
3           Amazon    21.3   321.2        1711.8
4        Microsoft    51.3   304.1        1966.6

**(A.3) Drop the column <code>assets</code>.**

In [9]:
company_df.drop(["assets"], axis = 1, inplace = True)

In [10]:
company_df

      company_name  profit  market_value
0   JPMorgan Chase    40.4         464.8
1            Apple    63.9        2252.3
2  Bank of America    17.9         336.3
3           Amazon    21.3        1711.8
4        Microsoft    51.3        1966.6

**(A.4) Delete the data of JPMorgan Chase and Bank of America.**

In [11]:
company_df.drop([0,2])

  company_name  profit  market_value
1        Apple    63.9        2252.3
3       Amazon    21.3        1711.8
4    Microsoft    51.3        1966.6

### [1.3] Sort

- **Sort a DataFrame by one column**

In [15]:
df.sort_values(by = "year")

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
2    Ohio  2002  3.6
4  Nevada  2002  2.9
5  Nevada  2003  3.2

- **Sort a DataFrame in descending order**

In [16]:
df.sort_values(by = "year", ascending = False)

    state  year  pop
5  Nevada  2003  3.2
2    Ohio  2002  3.6
4  Nevada  2002  2.9
1    Ohio  2001  1.7
3  Nevada  2001  2.4
0    Ohio  2000  1.5

- **Sort a DataFrame by multiple columns**

In [17]:
df.sort_values(by = ["year", "pop"])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9
2    Ohio  2002  3.6
5  Nevada  2003  3.2

- **Sort a DataFrame (inplace = True)**

In [18]:
df.sort_values(by = "year", ascending = False, inplace = True)
df

    state  year  pop
5  Nevada  2003  3.2
2    Ohio  2002  3.6
4  Nevada  2002  2.9
1    Ohio  2001  1.7
3  Nevada  2001  2.4
0    Ohio  2000  1.5

- **Reset index after sorting**<br>

In [19]:
# Drop the old index
df.reset_index(drop = True)

    state  year  pop
0  Nevada  2003  3.2
1    Ohio  2002  3.6
2  Nevada  2002  2.9
3    Ohio  2001  1.7
4  Nevada  2001  2.4
5    Ohio  2000  1.5

In [20]:
# Add the old index as an additional column to your DataFrame
df.reset_index(drop = False)

   index   state  year  pop
0      5  Nevada  2003  3.2
1      2    Ohio  2002  3.6
2      4  Nevada  2002  2.9
3      1    Ohio  2001  1.7
4      3  Nevada  2001  2.4
5      0    Ohio  2000  1.5

## Exercise.B

**(B.1) Use the dataframe <code>company_raw_df</code> in (A.1). Sort the dataframe by the <code>profit</code> column in a descending order and display the result.**

In [15]:
company_raw_df.sort_values(by="profit", ascending = False)

      company_name  profit  assets
1            Apple    63.9   354.1
4        Microsoft    51.3   304.1
0   JPMorgan Chase    40.4  3689.3
3           Amazon    21.3   321.2
2  Bank of America    17.9  2832.2

**(B.2) Store the returned result in (B.1) in a new variable named <code>company_sorted_df</code>.**

In [16]:
company_sorted_df = company_raw_df.sort_values(by="profit", ascending = False)
company_sorted_df

      company_name  profit  assets
1            Apple    63.9   354.1
4        Microsoft    51.3   304.1
0   JPMorgan Chase    40.4  3689.3
3           Amazon    21.3   321.2
2  Bank of America    17.9  2832.2

**(B.3) Reset the index of <code>company_sorted_df</code> and drop the old index.**

In [17]:
company_sorted_df.reset_index(drop=True)

      company_name  profit  assets
0            Apple    63.9   354.1
1        Microsoft    51.3   304.1
2   JPMorgan Chase    40.4  3689.3
3           Amazon    21.3   321.2
4  Bank of America    17.9  2832.2

## [2] Combining DataFrames

### [2.1] Concatenation

- **Concatenate series (by default, axis = 0)**

In [25]:
s1 = pd.Series([0,1], index = ['a','b'])
s2 = pd.Series([2,3,4], index = ['c','d','e'])
s3 = pd.Series([5,6], index = ['f','g'])

In [26]:
# Concatenate three series into one list
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

- **Concatenate series (axis = 1)**

In [27]:
# Concatenate series along the columns 
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

- **Concatenate series with the same index.**

In [28]:
s4 = pd.Series([0,1,2], index = ['a','b','c'])
s5 = pd.Series([3,4,5], index = ['a','b','c'])
s6 = pd.Series([6,7,8], index = ['a','b','c'])

In [29]:
pd.concat([s4,s5,s6], axis=1)

   0  1  2
a  0  3  6
b  1  4  7
c  2  5  8

- **Concatenating DataFrame (by default, axis = 0)**

In [30]:
df1 = pd.DataFrame({"col1":[1,2,3],"col2":[4,5,6],"col3":[7,8,9]}, index = ['a','b','c'])
df2 = pd.DataFrame({"col1":[11,22,33],"col2":[44,55,66],"col3":[77,88,99]},index = ['a','b','c'])

In [31]:
df1

   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6     9

In [32]:
df2

   col1  col2  col3
a    11    44    77
b    22    55    88
c    33    66    99

In [33]:
pd.concat([df1,df2])

   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6     9
a    11    44    77
b    22    55    88
c    33    66    99

In [36]:
pd.concat([df1,df2], ignore_index = True)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
3    11    44    77
4    22    55    88
5    33    66    99

- **Concatenating DataFrame (axis = 1)**

In [37]:
pd.concat([df1,df2], axis = 1)

   col1  col2  col3  col1  col2  col3
a     1     4     7    11    44    77
b     2     5     8    22    55    88
c     3     6     9    33    66    99

## Exercise.C

**(C.1) Import the datasets <code>municipality_info_part1.csv</code> and <code>municipality_info_part2.csv</code> as dataframes. The columns in the two datasets are described as follows.**
- Municipality_number (object)
- Population (int)
- Area (float)

Note: Use the argument "dtype" to specify the data types.<br>
<code>dtype = {"Municipality_number": object, "Population": int,  "Area": float} </code>.

In [20]:
mcp_part1 = pd.read_csv("../dataset/municipality_info_part1.csv", dtype = {"Municipality_number":object})
mcp_part1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Municipality_number  50 non-null     object
 1   Population           50 non-null     int64
 2   Area                 50 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

In [21]:
mcp_part2 = pd.read_csv("../dataset/municipality_info_part2.csv", dtype = {"Municipality_number":object})
mcp_part2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Municipality_number  50 non-null     object
 1   Population           50 non-null     int64
 2   Area                 50 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

**(C.2) Display the first five rows of each dataset.**

In [24]:
display(mcp_part1.head(5))
display(mcp_part2.head(5))

  Municipality_number  Population    Area
0                0301      673469  454.03
1                1101       14898  431.66
2                1103      141186  262.52
3                1106       37167   72.72
4                1108       76328  304.46

  Municipality_number  Population     Area
0                3048       18562   456.69
1                3049       25749   301.67
2                3401       17857  1036.45
3                3403       30598   350.94
4                3405       27781   478.17

**(C.3) Concatenate two dataframes in (C.1) along the rows and assign the returned dataframe to a new variable named <code>mcp_info</code>.**

In [26]:
mcp_info = pd.concat([mcp_part1, mcp_part2], axis = 0)
mcp_info

   Municipality_number  Population     Area
0                 0301      673469   454.03
1                 1101       14898   431.66
2                 1103      141186   262.52
3                 1106       37167    72.72
4                 1108       76328   304.46
..                 ...         ...      ...
45                5059       11891  1906.26
46                5401       74541  2521.28
47                5402       24845   445.17
48                5403       20446  3849.47
49                5421       14930  1953.81

[100 rows x 3 columns]

**(C.4) How many rows are in the dataframe <code>mcp_info</code>?**

In [28]:
mcp_info.shape[0]

100

### [2.2] Merge

In [43]:
df1 = pd.DataFrame({'employID':['E011','E012','E013','E014','E015','E016','E017'], 
                    'name':['John','Diana','Matthew','Jerry','Kathy','Sara','Alex']})
df2 = pd.DataFrame({'employID':['E010','E012','E013','E015','E016','E017'], 
                    'birthday':['20-07','12-06','18-01','16-05','02-10','19-08']})

In [44]:
df1

  employID     name
0     E011     John
1     E012    Diana
2     E013  Matthew
3     E014    Jerry
4     E015    Kathy
5     E016     Sara
6     E017     Alex

In [45]:
df2

  employID birthday
0     E010    20-07
1     E012    12-06
2     E013    18-01
3     E015    16-05
4     E016    02-10
5     E017    19-08

- **Left join**

In [46]:
pd.merge(df1,df2, how = 'left', on = 'employID' )

  employID     name birthday
0     E011     John      NaN
1     E012    Diana    12-06
2     E013  Matthew    18-01
3     E014    Jerry      NaN
4     E015    Kathy    16-05
5     E016     Sara    02-10
6     E017     Alex    19-08

- **Inner join**

In [47]:
pd.merge(df1,df2, how = 'inner', on = 'employID' )

  employID     name birthday
0     E012    Diana    12-06
1     E013  Matthew    18-01
2     E015    Kathy    16-05
3     E016     Sara    02-10
4     E017     Alex    19-08

- **Outer join**

In [48]:
pd.merge(df1,df2, how = 'outer', on = 'employID' )

  employID     name birthday
0     E011     John      NaN
1     E012    Diana    12-06
2     E013  Matthew    18-01
3     E014    Jerry      NaN
4     E015    Kathy    16-05
5     E016     Sara    02-10
6     E017     Alex    19-08
7     E010      NaN    20-07

In [49]:
df2.loc[1,"employID"]

'E012'

## Exercise.D

**(D.1) Import the dataset <code>municipality_name.csv</code> as a dataframe named<code>mcp_name</code>. The columns in the dataset are described as follows.**<br>
- Municipality_number (object)
- Municipality_name (object)

Note: Use the argument "encoding" to specify the character encoding.

In [32]:
mcp_name = pd.read_csv("../dataset/municipality_name.csv", dtype = {"Municipality_number":object}, encoding = "iso8859_10")
mcp_name.head(5)

  Municipality_number Municipality_name
0                0301              OSLO
1                3024             BÆRUM
2                3025             ASKER
3                3020      NORDRE FOLLO
4                3021                ÅS

**(D.2) Use the dataframe <code>mcp_info</code> obtained in (C.3). Find the municipality name corresponding to the municipality number from <code>mcp_name</code>. Add them to the new column in <code>mcp_info</code>.**

In [33]:
mcp_info.head(5)

  Municipality_number  Population    Area
0                0301      673469  454.03
1                1101       14898  431.66
2                1103      141186  262.52
3                1106       37167   72.72
4                1108       76328  304.46

In [35]:
mcp_df = pd.merge(mcp_info, mcp_name, how = "left", on = "Municipality_number")
mcp_df

   Municipality_number  Population     Area Municipality_name
0                 0301      673469   454.03              OSLO
1                 1101       14898   431.66         EIGERSUND
2                 1103      141186   262.52         STAVANGER
3                 1106       37167    72.72         HAUGESUND
4                 1108       76328   304.46           SANDNES
..                 ...         ...      ...               ...
95                5059       11891  1906.26           ORKLAND
96                5401       74541  2521.28            TROMSØ
97                5402       24845   445.17           HARSTAD
98                5403       20446  3849.47              ALTA
99                5421       14930  1953.81             SENJA

[100 rows x 4 columns]

**(D.3) List the five most populous municipalities.**

In [38]:
mcp_df.sort_values(by="Population", ascending = False).head(5)

   Municipality_number  Population    Area Municipality_name
0                 0301      673469  454.03              OSLO
78                4601      278556  464.70            BERGEN
87                5001      190464  342.21         TRONDHEIM
2                 1103      141186  262.52         STAVANGER
37                3024      124008  192.26             BÆRUM

**(D.4) Use the dataframe <code>mcp_name</code> obtained in (D.1). Find the size of municipality area corresponding to the municipality number from <code>mcp_info</code>. How many municipalities lack information about the area size?**

In [40]:
pd.merge(mcp_name, mcp_info, how = "left", on = "Municipality_number").info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 358 entries, 0 to 357
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Municipality_number  358 non-null    object
 1   Municipality_name    358 non-null    object
 2   Population           100 non-null    float64
 3   Area                 100 non-null    float64
dtypes: float64(2), object(2)
memory usage: 14.0+ KB